---
kind: method
id: M:Autodesk.Revit.DB.RoutingCriterionBase.IsEqual(Autodesk.Revit.DB.RoutingCriterionBase)
source: html/ae8ceb28-3b1c-85e2-8eb7-4ed9cabefa77.htm
---
# Autodesk.Revit.DB.RoutingCriterionBase.IsEqual Method

Verify if two criteria are the same.

## Syntax (C#)
```csharp
public bool IsEqual(
	RoutingCriterionBase pOther
)
```

## Parameters
- **pOther** (`Autodesk.Revit.DB.RoutingCriterionBase`)

## Returns
True if the criterion is equal to the other, false otherwise

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null